GHB2/src/Documents/гхб_РаспределениеДоступовВПомещения/гхб_РаспределениеДоступовВПомещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_РаспределениеДоступовВПомещения</name>
  <registerRecords>InformationRegister.гхб_РаспределениеДоступовВПомещения</registerRecords>
  <registerRecords>InformationRegister.гхб_РаспределениеДоступовВПомещенияЮридическиеЛица</registerRecords>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮридическоеЛицоСобственник</name>
      <type>
        <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮридическоеЛицоРаспорядитель</name>
      <type>
        <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ДивизионРаспорядитель</name>
      <type>
        <types>CatalogRef.гхб_Дивизионы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДепартаментРаспорядитель</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮридическиеЛицаВПомещении</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДивизионыВПомещении</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДепартаментыВПомещении</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЮридическиеЛицаВПомещениях</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮридическоеЛицо</name>
      <type>
        <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Дивизион</name>
      <type>
        <types>CatalogRef.гхб_Дивизионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Департамент</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуществующийДоступ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УточняющаяИнформация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_СобытияОбъектовБД/гхб_СобытияОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СобытияОбъектовБД</name>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гхб_ПользователиБазХолдинга</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаКонсервациюПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаПожарнуюБезопасность</types>
      <types>DocumentRef.гхб_СвойстваПомещений</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаПомещение</types>
      <types>DocumentRef.гхб_ЗакреплениеПомещенийЗаСотрудниками</types>
      <types>CatalogRef.Пользователи</types>
      <types>DocumentRef.гхб_ГруппыПомещений</types>
      <types>DocumentRef.гхб_РаспределениеДоступовВПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеСтатусаКонсервацииПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаЛокацию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.гхб_ТипыСобытийОбъектовБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РаспределениеДоступовВПомещения/гхб_РаспределениеДоступовВПомещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РаспределениеДоступовВПомещения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ЮридическоеЛицоСобственник</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицоРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ДивизионРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическиеЛицаВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДивизионыВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментыВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РаспределениеДоступовВПомещенияЮридическиеЛица/гхб_РаспределениеДоступовВПомещенияЮридическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РаспределениеДоступовВПомещенияЮридическиеЛица</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дивизион</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыСобытийОбъектовБД/гхб_ТипыСобытийОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыСобытийОбъектовБД</name>
  <enumValues>
    <name>ПервоеПроведениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПересчетПлощадиПомещений</name>
  </enumValues>
  <enumValues>
    <name>ПланируемаяБлокировкаПользователя</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтатусамКонсервацииПомещений</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_РаспределениеДоступовВПомещения/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументБылПроведен(_Ссылка)
	
	Возврат РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(_Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента);
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	ЭтотОбъект.ТолькоПросмотр = ДокументБылПроведен(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗакрытьПоРодителюВИстина(_ТекущиеДанные)
	
	Если НЕ (_ТекущиеДанные = Неопределено) Тогда
	
		Если _ТекущиеДанные.Закрыть И НЕ _ТекущиеДанные.СуществующийДоступ Тогда
		
			_ТекущиеДанные.Закрыть = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеЛицаВПомещенияхЗакрытьПриИзменении(Элемент)
	
	_ТД = Элементы.ЮридическиеЛицаВПомещениях.ТекущиеДанные;
	УстановитьЗакрытьПоРодителюВИстина(_ТД);
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеЛицаВПомещенияхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = (Элементы.Помещения.ТекущиеДанные = Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеЛицаВПомещенияхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТД = Элементы.ЮридическиеЛицаВПомещениях.ТекущиеДанные;
		ТД.Помещение = Элементы.Помещения.ТекущиеДанные.Помещение;
		ТД.СуществующийДоступ = Ложь;
		ТД.Закрыть = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПомещениеПриИзменении(Элемент)
	
	УстановитьОтборПоПомещению(Элементы.Помещения.ТекущиеДанные.Помещение);
	ЗаполнитьДанныеПоПомещению(Элементы.Помещения.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПомещению(_Помещение)
	
	СтруктураПоиска = Новый Структура("Помещение", _Помещение);
	
	Элементы.ЮридическиеЛицаВПомещениях.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоПомещению(_ТД)

	ЗаполнитьЗначенияСвойств(_ТД, ВернутьДанныеПоПомещению(_ТД.Помещение), , "Помещение");
	
	_СтруктураПоиска = Новый Структура("Помещение", _ТД.Помещение);
	
	Если Объект.ЮридическиеЛицаВПомещениях.НайтиСтроки(_СтруктураПоиска).Количество() = 0 Тогда
		_Массив = ВернутьДанныеЮридическиеЛицаВПомещениях(_ТД.Помещение);
		
		Для Каждого _Структура Из _Массив Цикл
			НС = Объект.ЮридическиеЛицаВПомещениях.Добавить();
			НС.Помещение = _ТД.Помещение;
			НС.ЮридическоеЛицо = _Структура.ЮридическоеЛицо;
			НС.Дивизион = _Структура.Дивизион;
			НС.Департамент = _Структура.Департамент;
			НС.Площадь = _Структура.Площадь;
			НС.УточняющаяИнформация = _Структура.УточняющаяИнформация;
			НС.СуществующийДоступ = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьДанныеПоПомещению(_Помещение)
	
	Возврат РегистрыСведений.гхб_РаспределениеДоступовВПомещения.ВернутьДанныеПоПомещению(_Помещение);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьДанныеЮридическиеЛицаВПомещениях(_Помещение)
	
	Возврат РегистрыСведений.гхб_РаспределениеДоступовВПомещенияЮридическиеЛица.ВернутьДанныеПоПомещению(_Помещение);
	
КонецФункции

&НаКлиенте
Процедура ПомещенияПриАктивизацииСтроки(Элемент)
	
	_ТД = Элементы.Помещения.ТекущиеДанные;
	
	УстановитьОтборПоПомещению(?(_ТД = Неопределено, ПредопределенноеЗначение("Справочник.гхб_Помещения.ПустаяСсылка"), _ТД.Помещение));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеЛицаВПомещенияхПередУдалением(Элемент, Отказ)
	
	_ТекущиеДанные = Элементы.ЮридическиеЛицаВПомещениях.ТекущиеДанные;
	
	Если НЕ (_ТекущиеДанные = Неопределено) И _ТекущиеДанные.СуществующийДоступ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеЛицаВПомещенияхПриАктивизацииСтроки(Элемент)
	
	_ТекущиеДанные = Элементы.ЮридическиеЛицаВПомещениях.ТекущиеДанные;
	
	Если НЕ (_ТекущиеДанные = Неопределено) Тогда
		Элементы.ЮридическиеЛицаВПомещенияхЮридическоеЛицо.ТолькоПросмотр = _ТекущиеДанные.СуществующийДоступ;
		Элементы.ЮридическиеЛицаВПомещенияхПлощадь.ТолькоПросмотр = _ТекущиеДанные.СуществующийДоступ;
		Элементы.ЮридическиеЛицаВПомещенияхУточняющаяИнформация.ТолькоПросмотр = _ТекущиеДанные.СуществующийДоступ;
	КонецЕсли;
	
КонецПроцедуры
